<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"77973727721046d14a475b5f4a1258b840526a4111b80fc087feb7c296d372dc","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1347 at https://github.com/cal-itp/data-infra/actions/runs/20971872193","plan_out_hash":"a3f222bc3d080b7897ceea675571cd52aec77c1745ada11bb0656fb66a3a3ff1","plan_hash":"2d18b52018be8951c75344119a228be8cdb479bcc309a55969bcb3ce7072d855","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/README.md"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "Uf9ILA==" -> (known after apply)
!~      detect_md5hash      = "7p0s8Je/yxIv8Fxq5ApeJA==" -> "different hash"
!~      generation          = 1765993228046232 -> (known after apply)
        id                  = "calitp-composer-dags/README.md"
!~      md5hash             = "7p0s8Je/yxIv8Fxq5ApeJA==" -> (known after apply)
        name                = "dags/README.md"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "hn2Mcw==" -> (known after apply)
!~      detect_md5hash      = "qwUd82Z30Y29GoeVS8qZSQ==" -> "different hash"
!~      generation          = 1768335715080491 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "qwUd82Z30Y29GoeVS8qZSQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/payments/_payments.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "u7oQTQ==" -> (known after apply)
!~      detect_md5hash      = "wLmnrdN+f5tBA3MWS+icfg==" -> "different hash"
!~      generation          = 1757032590670911 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/payments/_payments.yml"
!~      md5hash             = "wLmnrdN+f5tBA3MWS+icfg==" -> (known after apply)
        name                = "data/warehouse/models/mart/payments/_payments.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "OcaTag==" -> (known after apply)
!~      detect_md5hash      = "HmJeCvajFDILve4ocXKRUw==" -> "different hash"
!~      generation          = 1768335716796384 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "HmJeCvajFDILve4ocXKRUw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1347](https://github.com/cal-itp/data-infra/actions/runs/20971872193)